INSERT INTO Tool (name, stock)
VALUES ('Молоток', 50),
       ('Гаечный ключ', 50),
       ('Отвертка', 35),
       ('Набор головок', 15),
       ('Ключ для свечей', 10),
       ('Торцевой ключ', 20),
       ('Набор отверток', 30),
       ('Монтажный трос', 40),
       ('Пассатижи', 15),
       ('Компрессор', 5),
       ('Разводная гайка', 100),
       ('Гидравлический домкрат', 5),
       ('Клещи-кусачки', 20),
       ('Линейка', 30),
       ('Сверло', 50);

INSERT INTO Offer (name, description, price)
VALUES ('Замена масла', 'Замена масла в двигателе', 1000),
       ('Ремонт электрики', 'Диагностика и ремонт электрооборудования', 1500),
       ('Тормозные работы', 'Замена колодок и дисков', 1200),
       ('Ремонт двигателя', 'Капитальный ремонт двигателя', 5000),
       ('Замена стекла', 'Замена поврежденного стекла', 800),
       ('Шиномонтаж', 'Замена и балансировка шин', 500),
       ('Ремонт подвески', 'Замена элементов подвески', 900),
       ('Покраска автомобиля', 'Полная покраска автомобиля', 3000),
       ('Диагностика двигателя', 'Проверка и диагностика работы двигателя', 700),
       ('Замена аккумулятора', 'Замена старого аккумулятора на новый', 600);

INSERT INTO OfferTool (offerid, toolid)
VALUES (1, 13),
       (1, 14),
       (1, 1),
       (2, 7),
       (2, 2),
       (2, 3),
       (2, 4),
       (2, 5),
       (3, 6),
       (4, 13),
       (4, 14),
       (4, 1),
       (4, 10),
       (4, 11),
       (4, 12),
       (5, 8),
       (5, 9),
       (6, 7),
       (6, 2),
       (6, 3),
       (7, 6),
       (8, 15),
       (9, 13),
       (9, 14),
       (9, 1),
       (9, 10),
       (10, 8);


INSERT INTO Detail (name, stock, price)
VALUES ('Моторное масло', 20, 1000),
       ('Тормозная колодка', 15, 1500),
       ('Тормозной диск', 20, 2000),
       ('Свеча зажигания', 30, 500),
       ('Фильтр воздушный', 10, 800),
       ('Фильтр масляный', 12, 700),
       ('Топливный фильтр', 18, 600),
       ('Ремень генератора', 8, 1200),
       ('Подшипник ступицы', 5, 2000),
       ('Амортизаторы передние', 10, 3000),
       ('Рулевая рейка', 3, 4000),
       ('Лобовое стекло', 10, 3000),
       ('Шина', 30, 500),
       ('Аккумулятор', 5, 1500);

INSERT INTO offerdetail (offerid, detailid)
VALUES (1, 1),
       (2, 3),
       (3, 2),
       (3, 3),
       (4, 1),
       (4, 7),
       (4, 8),
       (5, 12),
       (6, 13),
       (7, 9),
       (7, 10),
       (10, 14);

INSERT INTO DetailProvider (name, contact)
VALUES ('Автозапчасти24', 'телефон: 8-800-555-35-35, email: info@avtozapchasti24.ru'),
       ('Запчастинет', 'телефон: 8-800-123-45-67, email: info@zapchinnet.ru'),
       ('АвтоМир', 'телефон: 8-800-987-65-43, email: info@avto-mir.ru'),
       ('Запчасти456', 'телефон: 8-800-111-22-33, email: info@zapchasti456.ru'),
       ('Запчасти7', 'телефон: 8-800-999-88-77, email: info@zapchasti7.ru'),
       ('АвтоЗапчасти2000', 'телефон: 8-800-222-11-00, email: info@avtozapchasti2000.ru'),
       ('ЗапчаМастер', 'телефон: 8-800-456-78-90, email: info@zapchamaster.ru'),
       ('АвтоДеталь', 'телефон: 8-800-333-44-55, email: info@avtodetali.ru'),
       ('ЗапчастиМир', 'телефон: 8-800-777-99-00, email: info@zapastimir.ru'),
       ('АвтоЗапас', 'телефон: 8-800-666-33-22, email: info@avtozapas.ru');

INSERT INTO detailproviderdetail (detailproviderid, detailid)
VALUES (1, 1),
       (1, 2),
       (2, 3),
       (2, 4),
       (3, 5),
       (3, 6),
       (4, 7),
       (4, 8),
       (5, 9),
       (5, 10),
       (6, 11),
       (6, 12),
       (7, 13),
       (7, 14),
       (8, 1),
       (8, 9),
       (9, 2),
       (9, 12),
       (10, 3),
       (10, 10);


INSERT INTO Client (name, surname, phone, email)
VALUES ('Иван', 'Иванов', '+79123456789', 'ivanov@example.com'),
       ('Петр', 'Петров', '+79234567890', 'petrov@example.com'),
       ('Алексей', 'Сидоров', '+79345678901', 'sidorov@example.com'),
       ('Елена', 'Смирнова', '+79456789012', 'smirnova@example.com'),
       ('Мария', 'Кузнецова', '+79567890123', 'kuznetsova@example.com'),
       ('Андрей', 'Васильев', '+79678901234', 'vasilev@example.com'),
       ('Ольга', 'Попова', '+79789012345', 'popova@example.com'),
       ('Сергей', 'Морозов', '+79890123456', 'morozov@example.com'),
       ('Татьяна', 'Новикова', '+79901234567', 'novikova@example.com'),
       ('Дмитрий', 'Козлов', '+79912345678', 'kozlov@example.com');

INSERT INTO Car (brand, model, creation_date)
VALUES
    ('Toyota', 'Corolla', '2018-01-01'),
    ('BMW', 'X5', '2019-05-15'),
    ('Mercedes-Benz', 'E-Class', '2017-11-20'),
    ('Volkswagen', 'Golf', '2020-09-10'),
    ('Audi', 'A4', '2016-03-07'),
    ('Honda', 'Civic', '2019-12-30'),
    ('Ford', 'Focus', '2017-06-18'),
    ('Chevrolet', 'Cruze', '2018-08-25'),
    ('Nissan', 'Qashqai', '2016-10-05'),
    ('Hyundai', 'Elantra', '2020-04-12');

INSERT INTO Employee (name, surname, snils)
VALUES
    ('Александр', 'Иванов', '123-456-789-01'),
    ('Анна', 'Петрова', '234-567-890-12'),
    ('Дмитрий', 'Сидоров', '345-678-901-23'),
    ('Екатерина', 'Смирнова', '456-789-012-34'),
    ('Иван', 'Кузнецов', '567-890-123-45'),
    ('Мария', 'Васильева', '678-901-234-56'),
    ('Николай', 'Попов', '789-012-345-67'),
    ('Ольга', 'Морозова', '890-123-456-78'),
    ('Павел', 'Новиков', '901-234-567-89'),
    ('Светлана', 'Козлова', '012-345-678-90');
